In [1]:
import pandas as pd
import numpy as np
import datetime
import sklearn

In [2]:
# Postulantes
postulantes = pd.read_csv('./data/postulantes_encoding_01.csv',\
                          low_memory=False)

# Avisos
avisos = pd.read_csv('./data/avisos_encoding_01.csv', \
                     low_memory=False)

# Transacciones
merged = pd.read_csv('./data/merged_encoding_01.csv', \
                     low_memory=False)

In [3]:
postulantes.count()

Unnamed: 0         504407
idpostulante       504407
sexo               504407
edad               504407
estado             504407
nivel_alcanzado    504407
dtype: int64

In [4]:
del postulantes['Unnamed: 0']

In [7]:
postulantes.head()

  idpostulante  sexo  edad  estado  nivel_alcanzado
0         NM5M     1  47.0     2.0              1.0
1         5awk     1  55.0     2.0              3.0
2         ZaO5     1  39.0     0.0              3.0
3         NdJl     2  49.0     1.0              4.0
4         eo2p     2  37.0     2.0              4.0

In [8]:
avisos.count()

Unnamed: 0              25288
idaviso                 25288
nombre_zona             25288
tipo_de_trabajo         25288
nivel_laboral           25288
nombre_area             25288
denominacion_empresa    25288
dtype: int64

In [9]:
del avisos['Unnamed: 0']
avisos.head()

,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,8725750,1,1,1,0,4005
1,17903700,1,1,1,7,1640
2,1000150677,0,1,1,4,1561
3,1000610287,1,1,1,4,4119
4,1000872556,1,1,1,5,1267

In [10]:
avisos_g = avisos
while len(avisos_g) < 504407:
    avisos_g = pd.concat([avisos_g, avisos])

In [11]:
avisos_g.count()

idaviso                 505760
nombre_zona             505760
tipo_de_trabajo         505760
nivel_laboral           505760
nombre_area             505760
denominacion_empresa    505760
dtype: int64

In [12]:
avisos_g = avisos_g[:504407]
avisos_g = sklearn.utils.shuffle(avisos_g)
avisos_g.count()

idaviso                 504407
nombre_zona             504407
tipo_de_trabajo         504407
nivel_laboral           504407
nombre_area             504407
denominacion_empresa    504407
dtype: int64

In [13]:
avisos_g = avisos_g.reset_index().drop('index',axis=1)

In [14]:
a_y_p = pd.concat([postulantes, avisos_g], axis = 1)
a_y_p.head()

,idpostulante,sexo,edad,estado,nivel_alcanzado,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,NM5M,1,47.0,2.0,1.0,1112426825,1,1,1,7,3984
1,5awk,1,55.0,2.0,3.0,1112312239,1,1,1,3,216
2,ZaO5,1,39.0,0.0,3.0,1111171416,1,1,1,3,827
3,NdJl,2,49.0,1.0,4.0,1112353853,1,1,1,5,1350
4,eo2p,2,37.0,2.0,4.0,1112300456,1,1,1,8,3552

In [15]:
del merged['Unnamed: 0']
merged.head()

,idaviso,idpostulante,sexo,edad,estado,nivel_alcanzado,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,1112257047,NM5M,1,47.0,2.0,1.0,1,0,3,3,1369
1,1112257047,1kJqGb,1,34.0,1.0,3.0,1,0,3,3,1369
2,1112257047,eOE9Rr,1,39.0,0.0,3.0,1,0,3,3,1369
3,1112257047,Zrx8Xz,1,39.0,2.0,2.0,1,0,3,3,1369
4,1112257047,ZrKNQY,1,32.0,1.0,3.0,1,0,3,3,1369

Excluimos las combinaciones de avisos y postulantes que estén en el data frame de postulaciones, de manera tal que nos queden las "no postulaciones".

In [16]:
a_y_p = a_y_p.drop(pd.merge(a_y_p,merged,\
    how='inner',on=['idpostulante','idaviso']).index,axis=0)
a_y_p.count()

idpostulante            504078
sexo                    504078
edad                    504078
estado                  504078
nivel_alcanzado         504078
idaviso                 504078
nombre_zona             504078
tipo_de_trabajo         504078
nivel_laboral           504078
nombre_area             504078
denominacion_empresa    504078
dtype: int64

In [17]:
a_y_p['sepostulo'] = 0
a_y_p.head(2)

,idpostulante,sexo,edad,estado,nivel_alcanzado,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa,sepostulo
329,8QEol,1,41.0,2.0,3.0,1112090290,1,1,1,6,3919,0
330,Z1E45,1,38.0,0.0,3.0,1112405758,1,1,1,8,2922,0

In [18]:
merged['sepostulo'] = 1
merged.count()

idaviso                 7742942
idpostulante            7742942
sexo                    7742942
edad                    7742942
estado                  7742942
nivel_alcanzado         7742942
nombre_zona             7742942
tipo_de_trabajo         7742942
nivel_laboral           7742942
nombre_area             7742942
denominacion_empresa    7742942
sepostulo               7742942
dtype: int64

In [19]:
train_data = pd.concat([a_y_p, merged])
train_data.count()

denominacion_empresa    8247020
edad                    8247020
estado                  8247020
idaviso                 8247020
idpostulante            8247020
nivel_alcanzado         8247020
nivel_laboral           8247020
nombre_area             8247020
nombre_zona             8247020
sepostulo               8247020
sexo                    8247020
tipo_de_trabajo         8247020
dtype: int64

In [20]:
train_data.head()

,denominacion_empresa,edad,estado,idaviso,idpostulante,nivel_alcanzado,nivel_laboral,nombre_area,nombre_zona,sepostulo,sexo,tipo_de_trabajo
329,3919,41.0,2.0,1112090290,8QEol,3.0,1,6,1,0,1,1
330,2922,38.0,0.0,1112405758,Z1E45,3.0,1,8,1,0,1,1
331,3744,43.0,0.0,1112443601,EK5Q2,3.0,1,1,0,0,1,1
332,3315,41.0,2.0,1112214364,NGEwM,3.0,3,3,0,0,2,1
333,665,41.0,2.0,1112325602,Y18JY,3.0,2,0,1,0,2,1

In [21]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder
from collections import defaultdict

In [22]:
X = train_data[['denominacion_empresa','edad','estado','nivel_alcanzado'\
                ,'nivel_laboral','nombre_area','nombre_zona','sexo','tipo_de_trabajo']]
Y = train_data['sepostulo']

In [23]:
X_train, X_test, y_train, y_test = \
    train_test_split(X, Y, test_size=0.10, random_state=7506)

In [24]:
print("Tamaño de X:\t\t", len(X), "\nTamaño de X_train:\t", \
      len(X_train), "\nTamaño de X_test:\t", len(X_test), \
      "\n\nTamaño de y:\t\t", len(Y), "\nTamaño de y_train:\t",\
      len(y_train), "\nTamaño de y_test:\t", len(y_test))

Tamaño de X:		 8247020
Tamaño de X_train:	 7422318
Tamaño de X_test:	 824702

Tamaño de y:		 8247020
Tamaño de y_train:	 7422318
Tamaño de y_test:	 824702

In [25]:
import winsound
def play_beep():
    duration = 500  # millisecond
    freq = 480  # Hz
    winsound.Beep(freq, duration)
play_beep()

In [26]:
# Random Forest
from sklearn.ensemble import RandomForestClassifier

params = {'n_estimators': 220, 'learning_rate': 0.0008 }

rfclassifier = RandomForestClassifier()
rfclassifier.fit(X_train, y_train.values.ravel())
play_beep()

In [27]:
# Probamos la precisión con el set de prueba
precision = round(rfclassifier.score(X_test, y_test) * 100, 2)
play_beep()
print(precision)

93.8

In [28]:
test_final = pd.read_csv('./data/test_final_100k.csv', low_memory=False)
test_final.head()

   id  idaviso idpostulante
0   0   739260       6M9ZQR
1   1   739260       6v1xdL
2   2   739260       ezRKm9
3   3   758580       1Q35ej
4   4   758580       EAN4J6

In [29]:
a_predecir = pd.merge(test_final, postulantes, on = 'idpostulante', how = 'left')
a_predecir.count()

id                 100000
idaviso            100000
idpostulante       100000
sexo               100000
edad               100000
estado             100000
nivel_alcanzado    100000
dtype: int64

In [30]:
a_predecir = pd.merge(a_predecir, avisos, on = 'idaviso', how = 'left')
a_predecir.count()

id                      100000
idaviso                 100000
idpostulante            100000
sexo                    100000
edad                    100000
estado                  100000
nivel_alcanzado         100000
nombre_zona             100000
tipo_de_trabajo         100000
nivel_laboral           100000
nombre_area             100000
denominacion_empresa    100000
dtype: int64

In [31]:
a_predecir.head()

,id,idaviso,idpostulante,sexo,edad,estado,nivel_alcanzado,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,0,739260,6M9ZQR,1,34.0,2.0,4.0,0,1,2,0,465
1,1,739260,6v1xdL,2,30.0,2.0,2.0,0,1,2,0,465
2,2,739260,ezRKm9,1,26.0,2.0,3.0,0,1,2,0,465
3,3,758580,1Q35ej,2,31.0,2.0,4.0,0,1,3,8,3895
4,4,758580,EAN4J6,1,53.0,0.0,3.0,0,1,3,8,3895

In [32]:
del a_predecir['id']
del a_predecir['idaviso']
del a_predecir['idpostulante']
array_a_predecir = a_predecir.values

In [33]:
probabilidades = []
predicciones = []
for x in array_a_predecir:
    #y_pred = lre.predict([x])
    #predicciones.append(y_pred)
    #print("Prediccion: " + str(y_pred))
    y_proba = rfclassifier.predict_proba([x])
    #print("Probabilidad de Acierto: " + str(round(y_proba[0][y_pred][0]* 100, 2))+"%")
    probabilidades.append(y_proba)

prob_post = []
for p in probabilidades:
    prob_post.append(p[0][1])

submit5 = pd.concat([test_final, pd.DataFrame(data = prob_post, \
                                             columns = ['sepostulo'])],axis=1)
del submit5['idaviso']
del submit5['idpostulante']
submit5.set_index('id', inplace = True)
submit5.to_csv('./submits/submit_rfc2.csv', encoding='utf-8')
play_beep()